In [14]:
import pandas as pd
df = pd.read_csv('Students.csv')

In [15]:
df.head()

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice  Female   15       85.0          90.0         175
1          2      Bob    Male   16        NaN          95.0          95
2          3  Charlie    Male   15       80.0           NaN          80
3          4    Diana  Female   16       90.0          85.0         175
4          5      Eve  Female   15       75.0          70.0         145

In [16]:
df.isnull().sum()

StudentID       0
Name            0
Gender          0
Age             0
MathScore       1
EnglishScore    1
TotalScore      0
dtype: int64

In [17]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler

In [27]:
# Handle missing data
df['MathScore'].fillna(df['MathScore'].mean(),inplace=True)

C:\Users\Dell\AppData\Local\Temp\ipykernel_12008\2596823194.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['MathScore'].fillna(df['MathScore'].mean(),inplace=True)

In [28]:
df['EnglishScore'].fillna(df['EnglishScore'].mean(),inplace=True)

C:\Users\Dell\AppData\Local\Temp\ipykernel_12008\2144733699.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['EnglishScore'].fillna(df['EnglishScore'].mean(),inplace=True)

In [29]:
le = LabelEncoder()
df['Gender'] = le.fit_transform(df['Gender'])
df[['Gender']]

   Gender
0       0
1       1
2       1
3       0
4       0

In [30]:
df['TotalScore'] = df['MathScore'] + df['EnglishScore']
df

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice       0   15       85.0          90.0       175.0
1          2      Bob       1   16       82.5          95.0       177.5
2          3  Charlie       1   15       80.0          85.0       165.0
3          4    Diana       0   16       90.0          85.0       175.0
4          5      Eve       0   15       75.0          70.0       145.0

In [33]:
scaler = StandardScaler()
df[['MathScore', 'EnglishScore', 'TotalScore']] = scaler.fit_transform(df[['MathScore', 'EnglishScore', 'TotalScore']])
df

   StudentID     Name  Gender  Age  MathScore  EnglishScore  TotalScore
0          1    Alice       0   15        0.5  5.976143e-01    0.622841
1          2      Bob       1   16        0.0  1.195229e+00    0.830455
2          3  Charlie       1   15       -0.5  4.440892e-17   -0.207614
3          4    Diana       0   16        1.5  4.440892e-17    0.622841
4          5      Eve       0   15       -1.5 -1.792843e+00   -1.868523